app/controllers/microposts_controller.rb

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First post!"], ["user_id", 1], ["created_at", "2015-09-27 21:40:37.624031"], ["updated_at", "2015-09-27 21:40:37.624031"]]

  def update
    respond_to do |format|
      if @micropost.update(micropost_params)
---
UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "Fourth"], ["updated_at", "2015-09-28 05:23:41.452370"], ["id", 4]]